MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/spi.h
/*
 * Component description for SPI
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:35:10Z  */
#ifndef _PIC32CZMC70_SPI_COMPONENT_H_
#define _PIC32CZMC70_SPI_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR SPI                       */
/* ************************************************************************** */

/* -------- SPI_CR : (SPI Offset: 0x00) ( /W 32) Control Register -------- */
#define SPI_CR_SPIEN_Pos                      _UINT32_(0)                                          /* (SPI_CR) SPI Enable Position */
#define SPI_CR_SPIEN_Msk                      (_UINT32_(0x1) << SPI_CR_SPIEN_Pos)                  /* (SPI_CR) SPI Enable Mask */
#define SPI_CR_SPIEN(value)                   (SPI_CR_SPIEN_Msk & (_UINT32_(value) << SPI_CR_SPIEN_Pos)) /* Assignment of value for SPIEN in the SPI_CR register */
#define SPI_CR_SPIDIS_Pos                     _UINT32_(1)                                          /* (SPI_CR) SPI Disable Position */
#define SPI_CR_SPIDIS_Msk                     (_UINT32_(0x1) << SPI_CR_SPIDIS_Pos)                 /* (SPI_CR) SPI Disable Mask */
#define SPI_CR_SPIDIS(value)                  (SPI_CR_SPIDIS_Msk & (_UINT32_(value) << SPI_CR_SPIDIS_Pos)) /* Assignment of value for SPIDIS in the SPI_CR register */
#define SPI_CR_SWRST_Pos                      _UINT32_(7)                                          /* (SPI_CR) SPI Software Reset Position */
#define SPI_CR_SWRST_Msk                      (_UINT32_(0x1) << SPI_CR_SWRST_Pos)                  /* (SPI_CR) SPI Software Reset Mask */
#define SPI_CR_SWRST(value)                   (SPI_CR_SWRST_Msk & (_UINT32_(value) << SPI_CR_SWRST_Pos)) /* Assignment of value for SWRST in the SPI_CR register */
#define SPI_CR_REQCLR_Pos                     _UINT32_(12)                                         /* (SPI_CR) Request to Clear the Comparison Trigger Position */
#define SPI_CR_REQCLR_Msk                     (_UINT32_(0x1) << SPI_CR_REQCLR_Pos)                 /* (SPI_CR) Request to Clear the Comparison Trigger Mask */
#define SPI_CR_REQCLR(value)                  (SPI_CR_REQCLR_Msk & (_UINT32_(value) << SPI_CR_REQCLR_Pos)) /* Assignment of value for REQCLR in the SPI_CR register */
#define SPI_CR_LASTXFER_Pos                   _UINT32_(24)                                         /* (SPI_CR) Last Transfer Position */
#define SPI_CR_LASTXFER_Msk                   (_UINT32_(0x1) << SPI_CR_LASTXFER_Pos)               /* (SPI_CR) Last Transfer Mask */
#define SPI_CR_LASTXFER(value)                (SPI_CR_LASTXFER_Msk & (_UINT32_(value) << SPI_CR_LASTXFER_Pos)) /* Assignment of value for LASTXFER in the SPI_CR register */
#define SPI_CR_Msk                            _UINT32_(0x01001083)                                 /* (SPI_CR) Register Mask  */


/* -------- SPI_MR : (SPI Offset: 0x04) (R/W 32) Mode Register -------- */
#define SPI_MR_MSTR_Pos                       _UINT32_(0)                                          /* (SPI_MR) Master/Slave Mode Position */
#define SPI_MR_MSTR_Msk                       (_UINT32_(0x1) << SPI_MR_MSTR_Pos)                   /* (SPI_MR) Master/Slave Mode Mask */
#define SPI_MR_MSTR(value)                    (SPI_MR_MSTR_Msk & (_UINT32_(value) << SPI_MR_MSTR_Pos)) /* Assignment of value for MSTR in the SPI_MR register */
#define   SPI_MR_MSTR_MASTER_Val              _UINT32_(0x1)                                        /* (SPI_MR) Master  */
#define   SPI_MR_MSTR_SLAVE_Val               _UINT32_(0x0)                                        /* (SPI_MR) Slave  */
#define SPI_MR_MSTR_MASTER                    (SPI_MR_MSTR_MASTER_Val << SPI_MR_MSTR_Pos)          /* (SPI_MR) Master Position */
#define SPI_MR_MSTR_SLAVE                     (SPI_MR_MSTR_SLAVE_Val << SPI_MR_MSTR_Pos)           /* (SPI_MR) Slave Position */
#define SPI_MR_PS_Pos                         _UINT32_(1)                                          /* (SPI_MR) Peripheral Select Position */
#define SPI_MR_PS_Msk                         (_UINT32_(0x1) << SPI_MR_PS_Pos)                     /* (SPI_MR) Peripheral Select Mask */
#define SPI_MR_PS(value)                      (SPI_MR_PS_Msk & (_UINT32_(value) << SPI_MR_PS_Pos)) /* Assignment of value for PS in the SPI_MR register */
#define SPI_MR_PCSDEC_Pos                     _UINT32_(2)                                          /* (SPI_MR) Chip Select Decode Position */
#define SPI_MR_PCSDEC_Msk                     (_UINT32_(0x1) << SPI_MR_PCSDEC_Pos)                 /* (SPI_MR) Chip Select Decode Mask */
#define SPI_MR_PCSDEC(value)                  (SPI_MR_PCSDEC_Msk & (_UINT32_(value) << SPI_MR_PCSDEC_Pos)) /* Assignment of value for PCSDEC in the SPI_MR register */
#define SPI_MR_MODFDIS_Pos                    _UINT32_(4)                                          /* (SPI_MR) Mode Fault Detection Position */
#define SPI_MR_MODFDIS_Msk                    (_UINT32_(0x1) << SPI_MR_MODFDIS_Pos)                /* (SPI_MR) Mode Fault Detection Mask */
#define SPI_MR_MODFDIS(value)                 (SPI_MR_MODFDIS_Msk & (_UINT32_(value) << SPI_MR_MODFDIS_Pos)) /* Assignment of value for MODFDIS in the SPI_MR register */
#define SPI_MR_WDRBT_Pos                      _UINT32_(5)                                          /* (SPI_MR) Wait Data Read Before Transfer Position */
#define SPI_MR_WDRBT_Msk                      (_UINT32_(0x1) << SPI_MR_WDRBT_Pos)                  /* (SPI_MR) Wait Data Read Before Transfer Mask */
#define SPI_MR_WDRBT(value)                   (SPI_MR_WDRBT_Msk & (_UINT32_(value) << SPI_MR_WDRBT_Pos)) /* Assignment of value for WDRBT in the SPI_MR register */
#define SPI_MR_LLB_Pos                        _UINT32_(7)                                          /* (SPI_MR) Local Loopback Enable Position */
#define SPI_MR_LLB_Msk                        (_UINT32_(0x1) << SPI_MR_LLB_Pos)                    /* (SPI_MR) Local Loopback Enable Mask */
#define SPI_MR_LLB(value)                     (SPI_MR_LLB_Msk & (_UINT32_(value) << SPI_MR_LLB_Pos)) /* Assignment of value for LLB in the SPI_MR register */
#define SPI_MR_PCS_Pos                        _UINT32_(16)                                         /* (SPI_MR) Peripheral Chip Select Position */
#define SPI_MR_PCS_Msk                        (_UINT32_(0xF) << SPI_MR_PCS_Pos)                    /* (SPI_MR) Peripheral Chip Select Mask */
#define SPI_MR_PCS(value)                     (SPI_MR_PCS_Msk & (_UINT32_(value) << SPI_MR_PCS_Pos)) /* Assignment of value for PCS in the SPI_MR register */
#define   SPI_MR_PCS_NPCS0_Val                _UINT32_(0xE)                                        /* (SPI_MR) NPCS0 as Chip Select  */
#define   SPI_MR_PCS_NPCS1_Val                _UINT32_(0xD)                                        /* (SPI_MR) NPCS1 as Chip Select  */
#define   SPI_MR_PCS_NPCS2_Val                _UINT32_(0xB)                                        /* (SPI_MR) NPCS2 as Chip Select  */
#define   SPI_MR_PCS_NPCS3_Val                _UINT32_(0x7)                                        /* (SPI_MR) NPCS3 as Chip Select  */
#define SPI_MR_PCS_NPCS0                      (SPI_MR_PCS_NPCS0_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS0 as Chip Select Position */
#define SPI_MR_PCS_NPCS1                      (SPI_MR_PCS_NPCS1_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS1 as Chip Select Position */
#define SPI_MR_PCS_NPCS2                      (SPI_MR_PCS_NPCS2_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS2 as Chip Select Position */
#define SPI_MR_PCS_NPCS3                      (SPI_MR_PCS_NPCS3_Val << SPI_MR_PCS_Pos)             /* (SPI_MR) NPCS3 as Chip Select Position */
#define SPI_MR_DLYBCS_Pos                     _UINT32_(24)                                         /* (SPI_MR) Delay Between Chip Selects Position */
#define SPI_MR_DLYBCS_Msk                     (_UINT32_(0xFF) << SPI_MR_DLYBCS_Pos)                /* (SPI_MR) Delay Between Chip Selects Mask */
#define SPI_MR_DLYBCS(value)                  (SPI_MR_DLYBCS_Msk & (_UINT32_(value) << SPI_MR_DLYBCS_Pos)) /* Assignment of value for DLYBCS in the SPI_MR register */
#define SPI_MR_Msk                            _UINT32_(0xFF0F00B7)                                 /* (SPI_MR) Register Mask  */


