MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/spi.h
/* -------- SPI_IDR : (SPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define SPI_IDR_RDRF_Pos                      _UINT32_(0)                                          /* (SPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define SPI_IDR_RDRF_Msk                      (_UINT32_(0x1) << SPI_IDR_RDRF_Pos)                  /* (SPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define SPI_IDR_RDRF(value)                   (SPI_IDR_RDRF_Msk & (_UINT32_(value) << SPI_IDR_RDRF_Pos)) /* Assignment of value for RDRF in the SPI_IDR register */
#define SPI_IDR_TDRE_Pos                      _UINT32_(1)                                          /* (SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Position */
#define SPI_IDR_TDRE_Msk                      (_UINT32_(0x1) << SPI_IDR_TDRE_Pos)                  /* (SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Mask */
#define SPI_IDR_TDRE(value)                   (SPI_IDR_TDRE_Msk & (_UINT32_(value) << SPI_IDR_TDRE_Pos)) /* Assignment of value for TDRE in the SPI_IDR register */
#define SPI_IDR_MODF_Pos                      _UINT32_(2)                                          /* (SPI_IDR) Mode Fault Error Interrupt Disable Position */
#define SPI_IDR_MODF_Msk                      (_UINT32_(0x1) << SPI_IDR_MODF_Pos)                  /* (SPI_IDR) Mode Fault Error Interrupt Disable Mask */
#define SPI_IDR_MODF(value)                   (SPI_IDR_MODF_Msk & (_UINT32_(value) << SPI_IDR_MODF_Pos)) /* Assignment of value for MODF in the SPI_IDR register */
#define SPI_IDR_OVRES_Pos                     _UINT32_(3)                                          /* (SPI_IDR) Overrun Error Interrupt Disable Position */
#define SPI_IDR_OVRES_Msk                     (_UINT32_(0x1) << SPI_IDR_OVRES_Pos)                 /* (SPI_IDR) Overrun Error Interrupt Disable Mask */
#define SPI_IDR_OVRES(value)                  (SPI_IDR_OVRES_Msk & (_UINT32_(value) << SPI_IDR_OVRES_Pos)) /* Assignment of value for OVRES in the SPI_IDR register */
#define SPI_IDR_NSSR_Pos                      _UINT32_(8)                                          /* (SPI_IDR) NSS Rising Interrupt Disable Position */
#define SPI_IDR_NSSR_Msk                      (_UINT32_(0x1) << SPI_IDR_NSSR_Pos)                  /* (SPI_IDR) NSS Rising Interrupt Disable Mask */
#define SPI_IDR_NSSR(value)                   (SPI_IDR_NSSR_Msk & (_UINT32_(value) << SPI_IDR_NSSR_Pos)) /* Assignment of value for NSSR in the SPI_IDR register */
#define SPI_IDR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (SPI_IDR) Transmission Registers Empty Disable Position */
#define SPI_IDR_TXEMPTY_Msk                   (_UINT32_(0x1) << SPI_IDR_TXEMPTY_Pos)               /* (SPI_IDR) Transmission Registers Empty Disable Mask */
#define SPI_IDR_TXEMPTY(value)                (SPI_IDR_TXEMPTY_Msk & (_UINT32_(value) << SPI_IDR_TXEMPTY_Pos)) /* Assignment of value for TXEMPTY in the SPI_IDR register */
#define SPI_IDR_UNDES_Pos                     _UINT32_(10)                                         /* (SPI_IDR) Underrun Error Interrupt Disable Position */
#define SPI_IDR_UNDES_Msk                     (_UINT32_(0x1) << SPI_IDR_UNDES_Pos)                 /* (SPI_IDR) Underrun Error Interrupt Disable Mask */
#define SPI_IDR_UNDES(value)                  (SPI_IDR_UNDES_Msk & (_UINT32_(value) << SPI_IDR_UNDES_Pos)) /* Assignment of value for UNDES in the SPI_IDR register */
#define SPI_IDR_Msk                           _UINT32_(0x0000070F)                                 /* (SPI_IDR) Register Mask  */


/* -------- SPI_IMR : (SPI Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define SPI_IMR_RDRF_Pos                      _UINT32_(0)                                          /* (SPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define SPI_IMR_RDRF_Msk                      (_UINT32_(0x1) << SPI_IMR_RDRF_Pos)                  /* (SPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define SPI_IMR_RDRF(value)                   (SPI_IMR_RDRF_Msk & (_UINT32_(value) << SPI_IMR_RDRF_Pos)) /* Assignment of value for RDRF in the SPI_IMR register */
#define SPI_IMR_TDRE_Pos                      _UINT32_(1)                                          /* (SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Position */
#define SPI_IMR_TDRE_Msk                      (_UINT32_(0x1) << SPI_IMR_TDRE_Pos)                  /* (SPI_IMR) SPI Transmit Data Register Empty Interrupt Mask Mask */
#define SPI_IMR_TDRE(value)                   (SPI_IMR_TDRE_Msk & (_UINT32_(value) << SPI_IMR_TDRE_Pos)) /* Assignment of value for TDRE in the SPI_IMR register */
#define SPI_IMR_MODF_Pos                      _UINT32_(2)                                          /* (SPI_IMR) Mode Fault Error Interrupt Mask Position */
#define SPI_IMR_MODF_Msk                      (_UINT32_(0x1) << SPI_IMR_MODF_Pos)                  /* (SPI_IMR) Mode Fault Error Interrupt Mask Mask */
#define SPI_IMR_MODF(value)                   (SPI_IMR_MODF_Msk & (_UINT32_(value) << SPI_IMR_MODF_Pos)) /* Assignment of value for MODF in the SPI_IMR register */
#define SPI_IMR_OVRES_Pos                     _UINT32_(3)                                          /* (SPI_IMR) Overrun Error Interrupt Mask Position */
#define SPI_IMR_OVRES_Msk                     (_UINT32_(0x1) << SPI_IMR_OVRES_Pos)                 /* (SPI_IMR) Overrun Error Interrupt Mask Mask */
#define SPI_IMR_OVRES(value)                  (SPI_IMR_OVRES_Msk & (_UINT32_(value) << SPI_IMR_OVRES_Pos)) /* Assignment of value for OVRES in the SPI_IMR register */
#define SPI_IMR_NSSR_Pos                      _UINT32_(8)                                          /* (SPI_IMR) NSS Rising Interrupt Mask Position */
#define SPI_IMR_NSSR_Msk                      (_UINT32_(0x1) << SPI_IMR_NSSR_Pos)                  /* (SPI_IMR) NSS Rising Interrupt Mask Mask */
#define SPI_IMR_NSSR(value)                   (SPI_IMR_NSSR_Msk & (_UINT32_(value) << SPI_IMR_NSSR_Pos)) /* Assignment of value for NSSR in the SPI_IMR register */
#define SPI_IMR_TXEMPTY_Pos                   _UINT32_(9)                                          /* (SPI_IMR) Transmission Registers Empty Mask Position */
#define SPI_IMR_TXEMPTY_Msk                   (_UINT32_(0x1) << SPI_IMR_TXEMPTY_Pos)               /* (SPI_IMR) Transmission Registers Empty Mask Mask */
#define SPI_IMR_TXEMPTY(value)                (SPI_IMR_TXEMPTY_Msk & (_UINT32_(value) << SPI_IMR_TXEMPTY_Pos)) /* Assignment of value for TXEMPTY in the SPI_IMR register */
#define SPI_IMR_UNDES_Pos                     _UINT32_(10)                                         /* (SPI_IMR) Underrun Error Interrupt Mask Position */
#define SPI_IMR_UNDES_Msk                     (_UINT32_(0x1) << SPI_IMR_UNDES_Pos)                 /* (SPI_IMR) Underrun Error Interrupt Mask Mask */
#define SPI_IMR_UNDES(value)                  (SPI_IMR_UNDES_Msk & (_UINT32_(value) << SPI_IMR_UNDES_Pos)) /* Assignment of value for UNDES in the SPI_IMR register */
#define SPI_IMR_Msk                           _UINT32_(0x0000070F)                                 /* (SPI_IMR) Register Mask  */


/* -------- SPI_CSR : (SPI Offset: 0x30) (R/W 32) Chip Select Register -------- */
#define SPI_CSR_CPOL_Pos                      _UINT32_(0)                                          /* (SPI_CSR) Clock Polarity Position */
#define SPI_CSR_CPOL_Msk                      (_UINT32_(0x1) << SPI_CSR_CPOL_Pos)                  /* (SPI_CSR) Clock Polarity Mask */
#define SPI_CSR_CPOL(value)                   (SPI_CSR_CPOL_Msk & (_UINT32_(value) << SPI_CSR_CPOL_Pos)) /* Assignment of value for CPOL in the SPI_CSR register */
#define   SPI_CSR_CPOL_IDLE_LOW_Val           _UINT32_(0x0)                                        /* (SPI_CSR) Clock is low when inactive (CPOL=0)  */
#define   SPI_CSR_CPOL_IDLE_HIGH_Val          _UINT32_(0x1)                                        /* (SPI_CSR) Clock is high when inactive (CPOL=1)  */
#define SPI_CSR_CPOL_IDLE_LOW                 (SPI_CSR_CPOL_IDLE_LOW_Val << SPI_CSR_CPOL_Pos)      /* (SPI_CSR) Clock is low when inactive (CPOL=0) Position */
#define SPI_CSR_CPOL_IDLE_HIGH                (SPI_CSR_CPOL_IDLE_HIGH_Val << SPI_CSR_CPOL_Pos)     /* (SPI_CSR) Clock is high when inactive (CPOL=1) Position */
#define SPI_CSR_NCPHA_Pos                     _UINT32_(1)                                          /* (SPI_CSR) Clock Phase Position */
#define SPI_CSR_NCPHA_Msk                     (_UINT32_(0x1) << SPI_CSR_NCPHA_Pos)                 /* (SPI_CSR) Clock Phase Mask */
#define SPI_CSR_NCPHA(value)                  (SPI_CSR_NCPHA_Msk & (_UINT32_(value) << SPI_CSR_NCPHA_Pos)) /* Assignment of value for NCPHA in the SPI_CSR register */
#define   SPI_CSR_NCPHA_VALID_LEADING_EDGE_Val _UINT32_(0x1)                                        /* (SPI_CSR) Data is valid on clock leading edge (NCPHA=1)  */
#define   SPI_CSR_NCPHA_VALID_TRAILING_EDGE_Val _UINT32_(0x0)                                        /* (SPI_CSR) Data is valid on clock trailing edge (NCPHA=0)  */
#define SPI_CSR_NCPHA_VALID_LEADING_EDGE      (SPI_CSR_NCPHA_VALID_LEADING_EDGE_Val << SPI_CSR_NCPHA_Pos) /* (SPI_CSR) Data is valid on clock leading edge (NCPHA=1) Position */
#define SPI_CSR_NCPHA_VALID_TRAILING_EDGE     (SPI_CSR_NCPHA_VALID_TRAILING_EDGE_Val << SPI_CSR_NCPHA_Pos) /* (SPI_CSR) Data is valid on clock trailing edge (NCPHA=0) Position */
#define SPI_CSR_CSNAAT_Pos                    _UINT32_(2)                                          /* (SPI_CSR) Chip Select Not Active After Transfer (Ignored if CSAAT = 1) Position */
#define SPI_CSR_CSNAAT_Msk                    (_UINT32_(0x1) << SPI_CSR_CSNAAT_Pos)                /* (SPI_CSR) Chip Select Not Active After Transfer (Ignored if CSAAT = 1) Mask */
#define SPI_CSR_CSNAAT(value)                 (SPI_CSR_CSNAAT_Msk & (_UINT32_(value) << SPI_CSR_CSNAAT_Pos)) /* Assignment of value for CSNAAT in the SPI_CSR register */
#define SPI_CSR_CSAAT_Pos                     _UINT32_(3)                                          /* (SPI_CSR) Chip Select Active After Transfer Position */
#define SPI_CSR_CSAAT_Msk                     (_UINT32_(0x1) << SPI_CSR_CSAAT_Pos)                 /* (SPI_CSR) Chip Select Active After Transfer Mask */
#define SPI_CSR_CSAAT(value)                  (SPI_CSR_CSAAT_Msk & (_UINT32_(value) << SPI_CSR_CSAAT_Pos)) /* Assignment of value for CSAAT in the SPI_CSR register */
#define SPI_CSR_BITS_Pos                      _UINT32_(4)                                          /* (SPI_CSR) Bits Per Transfer Position */
#define SPI_CSR_BITS_Msk                      (_UINT32_(0xF) << SPI_CSR_BITS_Pos)                  /* (SPI_CSR) Bits Per Transfer Mask */
#define SPI_CSR_BITS(value)                   (SPI_CSR_BITS_Msk & (_UINT32_(value) << SPI_CSR_BITS_Pos)) /* Assignment of value for BITS in the SPI_CSR register */
#define   SPI_CSR_BITS_8_BIT_Val              _UINT32_(0x0)                                        /* (SPI_CSR) 8 bits for transfer  */
#define   SPI_CSR_BITS_9_BIT_Val              _UINT32_(0x1)                                        /* (SPI_CSR) 9 bits for transfer  */
#define   SPI_CSR_BITS_10_BIT_Val             _UINT32_(0x2)                                        /* (SPI_CSR) 10 bits for transfer  */
#define   SPI_CSR_BITS_11_BIT_Val             _UINT32_(0x3)                                        /* (SPI_CSR) 11 bits for transfer  */
#define   SPI_CSR_BITS_12_BIT_Val             _UINT32_(0x4)                                        /* (SPI_CSR) 12 bits for transfer  */
#define   SPI_CSR_BITS_13_BIT_Val             _UINT32_(0x5)                                        /* (SPI_CSR) 13 bits for transfer  */
#define   SPI_CSR_BITS_14_BIT_Val             _UINT32_(0x6)                                        /* (SPI_CSR) 14 bits for transfer  */
#define   SPI_CSR_BITS_15_BIT_Val             _UINT32_(0x7)                                        /* (SPI_CSR) 15 bits for transfer  */
#define   SPI_CSR_BITS_16_BIT_Val             _UINT32_(0x8)                                        /* (SPI_CSR) 16 bits for transfer  */
#define SPI_CSR_BITS_8_BIT                    (SPI_CSR_BITS_8_BIT_Val << SPI_CSR_BITS_Pos)         /* (SPI_CSR) 8 bits for transfer Position */
#define SPI_CSR_BITS_9_BIT                    (SPI_CSR_BITS_9_BIT_Val << SPI_CSR_BITS_Pos)         /* (SPI_CSR) 9 bits for transfer Position */
#define SPI_CSR_BITS_10_BIT                   (SPI_CSR_BITS_10_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 10 bits for transfer Position */
#define SPI_CSR_BITS_11_BIT                   (SPI_CSR_BITS_11_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 11 bits for transfer Position */
#define SPI_CSR_BITS_12_BIT                   (SPI_CSR_BITS_12_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 12 bits for transfer Position */
#define SPI_CSR_BITS_13_BIT                   (SPI_CSR_BITS_13_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 13 bits for transfer Position */
#define SPI_CSR_BITS_14_BIT                   (SPI_CSR_BITS_14_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 14 bits for transfer Position */
#define SPI_CSR_BITS_15_BIT                   (SPI_CSR_BITS_15_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 15 bits for transfer Position */
#define SPI_CSR_BITS_16_BIT                   (SPI_CSR_BITS_16_BIT_Val << SPI_CSR_BITS_Pos)        /* (SPI_CSR) 16 bits for transfer Position */
#define SPI_CSR_SCBR_Pos                      _UINT32_(8)                                          /* (SPI_CSR) Serial Clock Bit Rate Position */
#define SPI_CSR_SCBR_Msk                      (_UINT32_(0xFF) << SPI_CSR_SCBR_Pos)                 /* (SPI_CSR) Serial Clock Bit Rate Mask */
#define SPI_CSR_SCBR(value)                   (SPI_CSR_SCBR_Msk & (_UINT32_(value) << SPI_CSR_SCBR_Pos)) /* Assignment of value for SCBR in the SPI_CSR register */
#define SPI_CSR_DLYBS_Pos                     _UINT32_(16)                                         /* (SPI_CSR) Delay Before SPCK Position */
#define SPI_CSR_DLYBS_Msk                     (_UINT32_(0xFF) << SPI_CSR_DLYBS_Pos)                /* (SPI_CSR) Delay Before SPCK Mask */
#define SPI_CSR_DLYBS(value)                  (SPI_CSR_DLYBS_Msk & (_UINT32_(value) << SPI_CSR_DLYBS_Pos)) /* Assignment of value for DLYBS in the SPI_CSR register */
#define SPI_CSR_DLYBCT_Pos                    _UINT32_(24)                                         /* (SPI_CSR) Delay Between Consecutive Transfers Position */
#define SPI_CSR_DLYBCT_Msk                    (_UINT32_(0xFF) << SPI_CSR_DLYBCT_Pos)               /* (SPI_CSR) Delay Between Consecutive Transfers Mask */
#define SPI_CSR_DLYBCT(value)                 (SPI_CSR_DLYBCT_Msk & (_UINT32_(value) << SPI_CSR_DLYBCT_Pos)) /* Assignment of value for DLYBCT in the SPI_CSR register */
#define SPI_CSR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SPI_CSR) Register Mask  */


/* -------- SPI_WPMR : (SPI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SPI_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (SPI_WPMR) Write Protection Enable Position */
#define SPI_WPMR_WPEN_Msk                     (_UINT32_(0x1) << SPI_WPMR_WPEN_Pos)                 /* (SPI_WPMR) Write Protection Enable Mask */
#define SPI_WPMR_WPEN(value)                  (SPI_WPMR_WPEN_Msk & (_UINT32_(value) << SPI_WPMR_WPEN_Pos)) /* Assignment of value for WPEN in the SPI_WPMR register */
#define SPI_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (SPI_WPMR) Write Protection Key Position */
#define SPI_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << SPI_WPMR_WPKEY_Pos)           /* (SPI_WPMR) Write Protection Key Mask */
#define SPI_WPMR_WPKEY(value)                 (SPI_WPMR_WPKEY_Msk & (_UINT32_(value) << SPI_WPMR_WPKEY_Pos)) /* Assignment of value for WPKEY in the SPI_WPMR register */
#define   SPI_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x535049)                                   /* (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SPI_WPMR_WPKEY_PASSWD                 (SPI_WPMR_WPKEY_PASSWD_Val << SPI_WPMR_WPKEY_Pos)    /* (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position */
#define SPI_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (SPI_WPMR) Register Mask  */


/* -------- SPI_WPSR : (SPI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define SPI_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (SPI_WPSR) Write Protection Violation Status Position */
#define SPI_WPSR_WPVS_Msk                     (_UINT32_(0x1) << SPI_WPSR_WPVS_Pos)                 /* (SPI_WPSR) Write Protection Violation Status Mask */
#define SPI_WPSR_WPVS(value)                  (SPI_WPSR_WPVS_Msk & (_UINT32_(value) << SPI_WPSR_WPVS_Pos)) /* Assignment of value for WPVS in the SPI_WPSR register */
#define SPI_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (SPI_WPSR) Write Protection Violation Source Position */
#define SPI_WPSR_WPVSRC_Msk                   (_UINT32_(0xFF) << SPI_WPSR_WPVSRC_Pos)              /* (SPI_WPSR) Write Protection Violation Source Mask */
#define SPI_WPSR_WPVSRC(value)                (SPI_WPSR_WPVSRC_Msk & (_UINT32_(value) << SPI_WPSR_WPVSRC_Pos)) /* Assignment of value for WPVSRC in the SPI_WPSR register */
#define SPI_WPSR_Msk                          _UINT32_(0x0000FF01)                                 /* (SPI_WPSR) Register Mask  */


/* SPI register offsets definitions */
#define SPI_CR_REG_OFST                _UINT32_(0x00)      /* (SPI_CR) Control Register Offset */
#define SPI_MR_REG_OFST                _UINT32_(0x04)      /* (SPI_MR) Mode Register Offset */
#define SPI_RDR_REG_OFST               _UINT32_(0x08)      /* (SPI_RDR) Receive Data Register Offset */
#define SPI_TDR_REG_OFST               _UINT32_(0x0C)      /* (SPI_TDR) Transmit Data Register Offset */
#define SPI_SR_REG_OFST                _UINT32_(0x10)      /* (SPI_SR) Status Register Offset */
#define SPI_IER_REG_OFST               _UINT32_(0x14)      /* (SPI_IER) Interrupt Enable Register Offset */
#define SPI_IDR_REG_OFST               _UINT32_(0x18)      /* (SPI_IDR) Interrupt Disable Register Offset */
#define SPI_IMR_REG_OFST               _UINT32_(0x1C)      /* (SPI_IMR) Interrupt Mask Register Offset */
#define SPI_CSR_REG_OFST               _UINT32_(0x30)      /* (SPI_CSR) Chip Select Register Offset */
#define SPI_CSR0_REG_OFST              _UINT32_(0x30)      /* (SPI_CSR0) Chip Select Register Offset */
#define SPI_CSR1_REG_OFST              _UINT32_(0x34)      /* (SPI_CSR1) Chip Select Register Offset */
#define SPI_CSR2_REG_OFST              _UINT32_(0x38)      /* (SPI_CSR2) Chip Select Register Offset */
#define SPI_CSR3_REG_OFST              _UINT32_(0x3C)      /* (SPI_CSR3) Chip Select Register Offset */
#define SPI_WPMR_REG_OFST              _UINT32_(0xE4)      /* (SPI_WPMR) Write Protection Mode Register Offset */
#define SPI_WPSR_REG_OFST              _UINT32_(0xE8)      /* (SPI_WPSR) Write Protection Status Register Offset */

